src/competitive-strategy.org
#+title: 竞争策略(Competive Strategy)
https://www.coursera.org/learn/competitivestrategyzh/outline

** 关注你的竞争对手 Take Care of Your Competitors
在本模块中，我们将介绍博弈论的基本概念，并分析策略博弈中的竞争情况。我们将明确什么是策略并寻求不同的方式来确定最佳策略或优势策略。我们还将讨论纳什均衡和囚徒困境概念，分析为什么在决策时考量其他局中人的行动至关重要。最后，我们还将分析同时博弈（所有人同时行动）更改为序贯博弈（局中人按序行动）时会出现的情况。

- 同时博弈 Simultaneous Games
  - 博弈设定：Players, Actions, Payoffs, Rules. 博弈矩阵(Game Matrix).
  - 消除劣势策略(Dominated Strategies): vs. 优势策略(Dominate Strategy)
  - 纳什均衡(Nash Equilibrium): 一组策略，任意一方都不会单方面背离当前策略，所有参与方都达到一个稳定状态。博弈的自然静止点。
    - NE就是优势策略吗？no, 优势策略是针对个人并且唯一，而NE针对群体并且会包含一组策略
    - NE会包含劣势策略吗？no, 因为个人总可以找到一个更好策略脱离稳定状态
    - 每个NE都会包含优势策略吗？no.
    - 不是每个game(纯策略)都有NE；一个game可能有多个NE
  - 囚徒困境(Prisoners' Dilemma)
- 序贯博弈 Sequential Games
   - 博弈设定：博弈树(Game Tree).
   - 逆向归纳法(Backward Induction)
   - 可信威胁(Credible Threats)

** 企业为何要合作 Why Firms Work Together
根据经济学理论，企业会在市场上相互竞争。实际上，他们也常常进行友好合作。在本模块中，我们将尝试了解为什么合作会给相关企业带来好处，借此评估促进或阻碍合作的因素并将其应用到不同示例中。

- 合作的原因 Reasons for Cooperation
  - 避免无效的解决方案. e.g. 囚徒困境.
  - 重复博弈和承诺可以促成合作
- 重复博弈 Repeated Games
  - 有限次重复 Finite Repetition
    - 结局效应(Endgame effect): 最后一轮博弈没有进一步报复性威胁
    - 并不会比单次博弈更容易实现合作
    - 可以通过逆向归纳法来进行分析
  - 无限次重复 Infinite Repetition
    - 触发策略(trigger strategy)
    - 用p来表示进行合作的概率
    - 如果合作带来的收益是x的话，那么持续合作带来的收益则是x * (p + p**2 + ...) = x / (1-p)
    - 和有限次重复的差别在于长期回报
    - 影响合作的因素:
      - 竞争者的数量（越少越利于合作），
      - 未来收益比如利率(interest)（利率越低越利于合作），
      - 惩罚力度（力度越大越利于合作）
    - 相比单次博弈和有限次重复博弈更容易形成合作
- 承诺 Commitment
  - 积极承诺 Aggressive Commitment
    - 优先采取行动
    - 试图减少可能引发劣性均衡的行为
    - 将同时博弈变为序贯博弈
  - 合作承诺 Cooperative Commitment
    - 试图消除会导致竞争均衡的行为，软承诺(soft commitment)
    - 建立声誉，竞争对手可以很容易预测你的行为
    - 自我束缚承诺(self-binding commitment)
    - 补偿差价条款. 正阳降低价格不仅降低未来利润，还要补偿之前的差价

** 互补产品和战略合作伙伴关系 Complementary Products and Strategic Partnerships
在本模块中，我们将介绍互补产品的概念，并运用经济学术语来探讨它们的意义。我们将研究企业为何想要将产品捆绑出售，以及互补性如何产生转换成本。我们还将讨论企业间的协调对互补产品的重要性。最后，我们将学习战略合作伙伴关系作为一强大工具如何在特定环境下为企业带来利益。

- 互补产品：示例和定义 Complements: Examples and Definitions
  - U=Utility. U(A+B) > U(A) + U(B). 则称A，B为互补产品
  - 交叉弹性价格(Cross Price Elasticity)：产品B的销量取决于产品A的价格
  - 如果A价格下降B的需求量则增加（也可以作为互补产品定义），那么CPE就是负数。反之则为正数。
- 互补产品策略 Strategies for Complements
  - 通用策略 Generic Strategies
    - 支持互补品生产：帮助提升互补品质量和需求，甚至自己生产互补品
    - 自己生产互补品风险：1. 可能市场不够大 2. 缺乏竞争力 3. 潜在消费者无法接受
    - 自己生产互补品优势：1. 做定制化 2. 控制质量 3. 正外部性(*, 后面会说到)
  - 正外部性(Positive Externalities)
    - Internalisation of positive effects(externalities) that complements extert on each other.
    - cross subsidies 交叉补贴 # 消费者可能不会购买，或者是从其他厂商购买。
    - bundlig 捆绑销售 # 分开销售如何定价的问题
    - increasing lock-in 增加联合套牢效果 # 用户更换到替代品需要额外成本
- 互补产品和合作 Complements and Cooperation
  - 进行完全整合比较困难，比如企业希望保持独立，或者只有很小部分的互补
  - 那么可以选择战略合作伙伴关系(Strategic Partnerships)，下面是SP的几个特征
  - 共同决策(Shared Decision Making)
  - organisational linkages & coordination mechanisms 组织联系，合作机制 => organisational integration 组织集成
  - joint equity ownership 股份所有制（交叉持股，利益相互联系） => economic integration 经济整合

** 进入新市场 Entering a New Market
本模块与市场进入有关。我们首先看一下用于评估市场吸引力的不同工具，再讨论已被证明有助于进入新市场的策略。我们也会从其他角度分析这一现象，了解现有企业为了阻挡新竞争者进入市场需要采取的措施。

- 市场选择 Choice of Market
  - 1) 评估不同市场的吸引力 2) 决定要进入哪个市场 3) 选择适当的市场进入类型 4) 选择合适的进入战略
  - 市场吸引力 Market Attractiveness
    - 波特五力(Porter's Five Forces): 一个市场的五种不同特征，决定市场的吸引力
    - competition(业内竞争), supplier(议价能力), buyer(议价能力), potential-new-entrants(潜在进入者，造成市场壁垒), substitues(代替品，影响价格弹性)
    - government regulation and taxation(政府监管和税收)
  - 结构性进入壁垒(Structural Entry Barriers): 行业本身造成的限制
    - 控制关键资源 # 1. 自然资源 2. 供应商 3. 专利 4. 分销渠道 5. 地理位置(比如超市) 6. 时间(timing)(比如停机位) 7. 政府监管(比如出租车牌照)
    - 规模经济，比如半导体行业, 包括初始成本以及边际成本
    - 营销优势，比如已有客户群
  - 战略性进入壁垒(Strategic Entry Barriers): 战略手段产生的限制竞争者进入
    - 比如上下游投资，或者是和顾客签订长期合同
    - 遏制必须要带来收益，并且阻止其他参与者进入市场
- 进入策略 Entry Strategies
  - 承诺战略 Commitment
    - 某个后来者为了留在市场中作出的可信承诺，以此来防止现有企业的报复
    - 承诺：1. 高昂的沉没成本 2. 退出其他战略细分市场而只关注刚进入的市场
    - #note: 视频中的例子显示这会影响到博弈树最终变换到另外一个均衡上。比较适合成型的大公司。
  - 价值链重构 Value Chain Reconfiguration # 以廉价但是质量略差的产品形态进入市场，然后不断改进产品质量来扩大份额，而原有者很难复制相同的劣质产品。
  - 柔道战略 Judo Economics # 同样是以低廉的价格(但是质量相同的产品)进入小部分市场(利基市场), 原有者担心价格战会影响到自己原有市场，所以没有办法进行报复。
  - 利基市场 Niche Market
    - 利基市场指的是后来者获取利润的市场, 后来者可以在利基市场上不断扩大份额而不用担心原有者报复。
    - 原有者触发报复有两个点：一个是利基市场变大，一个报复成本降低(比如可以针对特定区域降价)
    - #note: or 缝隙市场 ?
- 进入遏制 Entry Deterrence
  - 承诺战略 Commitment # 视频中的例子同样显示了如何影响决策以及变换到另外一个均衡上的
  - 限制性定价(Limit Pricing)
    - 参与者进入市场之前的低价，防止参与者进入
    - 暗示市场低迷以及现任者生产成本很低
    - 只有在信息不完全时候发挥作用
  - 掠夺性定价(Predatory Pricing)
    - 参与者进入市场之后的低价，驱逐出参与者
    - 同样也只有在信息不完全时候发挥作用
  - 先占策略(Preemption)
    - 用代价昂贵的行为来阻止其他潜在竞争者进入
    - 过度投资以将生产成本降低到无进入威胁时的最佳水平之下
    - 追求水平产品差异化以扩展产品品种，超过没有进入威胁时的最佳水平
    - 更加密集地选择销售点位置，超过在无进入威胁时的最佳水平

** 为何要关注研发？Why Worry About Research and Development
在探讨研发的时候，一些重要的策略问题会反复出现。我们将通过本模块仔细研究这些问题。不少创新的诞生的确是源自好运气，但似乎毋庸置疑——大部分时候是因为创新者积极努力实现某个具体的发明。

- 研发和创新 R&D and Innovation
  - 研发的不同阶段 Stages of R&D
    - 基础研究 Basic Research # 不容易保护产出，并且可能通过公开刊物会议等方式发生知识外溢(knowledge spilover)
    - 应用研究 Applied Research # 可以通过专利保护产出，造成专利竞赛
    - 产品开发 Production Development
  - 创新的不同类型 Types of Innovation
    - 产品创新(Product Innovation) # 创造新产品
    - 过程创新(Process Innovation) # 改进现有产品生产
    - 突破性创新(Drastic Innovattion) # 创造突破性产品垄断市场
    - 渐进式创新(Incremental Innovation) # 改进现有产品提高而非垄断市场
- 创新的激励 Incentives to Innovate
  - 竞争性市场 Competitive Market
  - 垄断者 Monopolist. # 在完全垄断市场中(没有进入威胁)，替代效应(Replacement Effect)表明垄断者的创新动机更小，相比于竞争者
  - 垄断者对新入者的威胁 Monopolist with Threat of Entry # 效率效应(Efficienty Effect)存在进入威胁时，垄断企业相比潜在进入企业有更大的创新动力
  - RE表明垄断企业创新性不够，因为新利润会取代老利润。EE表明垄断企业有更大创新性，致力于保持自己的垄断地位。trade-off取决于有进入威胁的概率。
  - 进入市场的概率决定垄断企业是否需要创新。如果参与者进入市场困难的话，那么垄断企业更加倾向于不进行创新而保持固有利润。如果要鼓励创新的话，那么就必须降低进入的门槛。
- 创新和竞争 Innovation & Competition
  - 在竞争中创新 Innovation under Competition
  - 沉睡专利(Sleeping Patents)
    - 小专利且没有什么特别创新，公司注册它但是不打算将其商业化它。
    - 这些专利主要是针对和自己产品特别类似的创新，阻止竞争对手使用这类创新，维持自身垄断地位。

** 合理设计产品 Designing Products Wisely
在本模块中，我们侧重于产品设计的策略问题。我们会分析企业如何通过调整自己的产品来减小市场竞争压力。稍后，我们会学习产品设计和定价方面的一些通用策略，并讨论在这些策略之间进退两难的相关问题。

- 伯特兰德悖论(Bertrand Paradox)
  - 理论模型 Theoretical Model # 双方都使用低价策略，最终价格低到边际成本，导致没有利润
  - 调整模型假设 Adjusting Model Assumptions # 通过调整模型假设，比如生产差异化产品等方式，可以避开伯特兰德悖论
- 产品差异化 Product Differentiation
  - 水平 vs. 垂直差异化. # 相同价格，部分人会选择A部分人选择B，那么AB是水平差异。相同价格，所有人都选择A而不是B，那么AB是垂直差异(所以AB需要在价格上区分)
  - 水平差异化(Horizontal Differentiation)：# 产品AB之间的差异难以比较，比如衣服的颜色款式
  - 垂直差异化(Vertical Differentiation): # 产品AB之间的差异可以比较，比如电脑的内存容量和CPU频率
- 定价和产品决策 Pricing and Product Decisions
  - 通用战略 Generic Strategies
    - 成本领先战略(Cost Leadership): 努力使成本低于对手。边际消费者是利润空间非常低的群体，需要避开他们。
    - 差异化模式(Differentiation)
    - 集中化模式(Focus): 集合前面两种战略特征，重点关注一个特定的消费群体，产品线或者是地理市场，而忽略市场中其他部分。
  - 进退两难 Stuck in the Middle
    - 如果低价和差异化策略都没有做好的话，那么就处于进退两难境地。
    - 二元化(Amibidexterity) # 同时实施低价以及差异化策略
